sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.h
/* GPIO_BC */
#define GPIO_BC_CR0                BIT(0)                          /*!< pin 0 clear bit */
#define GPIO_BC_CR1                BIT(1)                          /*!< pin 1 clear bit */
#define GPIO_BC_CR2                BIT(2)                          /*!< pin 2 clear bit */
#define GPIO_BC_CR3                BIT(3)                          /*!< pin 3 clear bit */
#define GPIO_BC_CR4                BIT(4)                          /*!< pin 4 clear bit */
#define GPIO_BC_CR5                BIT(5)                          /*!< pin 5 clear bit */
#define GPIO_BC_CR6                BIT(6)                          /*!< pin 6 clear bit */
#define GPIO_BC_CR7                BIT(7)                          /*!< pin 7 clear bit */
#define GPIO_BC_CR8                BIT(8)                          /*!< pin 8 clear bit */
#define GPIO_BC_CR9                BIT(9)                          /*!< pin 9 clear bit */
#define GPIO_BC_CR10               BIT(10)                         /*!< pin 10 clear bit */
#define GPIO_BC_CR11               BIT(11)                         /*!< pin 11 clear bit */
#define GPIO_BC_CR12               BIT(12)                         /*!< pin 12 clear bit */
#define GPIO_BC_CR13               BIT(13)                         /*!< pin 13 clear bit */
#define GPIO_BC_CR14               BIT(14)                         /*!< pin 14 clear bit */
#define GPIO_BC_CR15               BIT(15)                         /*!< pin 15 clear bit */

/* GPIO_TG */
#define GPIO_TG_TG0                BIT(0)                          /*!< pin 0 toggle bit */
#define GPIO_TG_TG1                BIT(1)                          /*!< pin 1 toggle bit */
#define GPIO_TG_TG2                BIT(2)                          /*!< pin 2 toggle bit */
#define GPIO_TG_TG3                BIT(3)                          /*!< pin 3 toggle bit */
#define GPIO_TG_TG4                BIT(4)                          /*!< pin 4 toggle bit */
#define GPIO_TG_TG5                BIT(5)                          /*!< pin 5 toggle bit */
#define GPIO_TG_TG6                BIT(6)                          /*!< pin 6 toggle bit */
#define GPIO_TG_TG7                BIT(7)                          /*!< pin 7 toggle bit */
#define GPIO_TG_TG8                BIT(8)                          /*!< pin 8 toggle bit */
#define GPIO_TG_TG9                BIT(9)                          /*!< pin 9 toggle bit */
#define GPIO_TG_TG10               BIT(10)                         /*!< pin 10 toggle bit */
#define GPIO_TG_TG11               BIT(11)                         /*!< pin 11 toggle bit */
#define GPIO_TG_TG12               BIT(12)                         /*!< pin 12 toggle bit */
#define GPIO_TG_TG13               BIT(13)                         /*!< pin 13 toggle bit */
#define GPIO_TG_TG14               BIT(14)                         /*!< pin 14 toggle bit */
#define GPIO_TG_TG15               BIT(15)                         /*!< pin 15 toggle bit */

/* GPIO_SMCCTL */
#define GPIO_SMCCTL_SMC0           BIT(0)                          /*!< pin 0 safe mode control */
#define GPIO_SMCCTL_SMC1           BIT(1)                          /*!< pin 1 safe mode control */
#define GPIO_SMCCTL_SMC2           BIT(2)                          /*!< pin 2 safe mode control */
#define GPIO_SMCCTL_SMC3           BIT(3)                          /*!< pin 3 safe mode control */
#define GPIO_SMCCTL_SMC4           BIT(4)                          /*!< pin 4 safe mode control */
#define GPIO_SMCCTL_SMC5           BIT(5)                          /*!< pin 5 safe mode control */
#define GPIO_SMCCTL_SMC6           BIT(6)                          /*!< pin 6 safe mode control */
#define GPIO_SMCCTL_SMC7           BIT(7)                          /*!< pin 7 safe mode control */
#define GPIO_SMCCTL_SMC8           BIT(8)                          /*!< pin 8 safe mode control */
#define GPIO_SMCCTL_SMC9           BIT(9)                          /*!< pin 9 safe mode control */
#define GPIO_SMCCTL_SMC10          BIT(10)                         /*!< pin 10 safe mode control */
#define GPIO_SMCCTL_SMC11          BIT(11)                         /*!< pin 11 safe mode control */
#define GPIO_SMCCTL_SMC12          BIT(12)                         /*!< pin 12 safe mode control */
#define GPIO_SMCCTL_SMC13          BIT(13)                         /*!< pin 13 safe mode control */
#define GPIO_SMCCTL_SMC14          BIT(14)                         /*!< pin 14 safe mode control */
#define GPIO_SMCCTL_SMC15          BIT(15)                         /*!< pin 15 safe mode control */

/* GPIO_IFEN */
#define GPIO_IFEN_IFE0             BIT(0)                          /*!< pin 0 input filter enable */
#define GPIO_IFEN_IFE1             BIT(1)                          /*!< pin 1 input filter enable */
#define GPIO_IFEN_IFE2             BIT(2)                          /*!< pin 2 input filter enable */
#define GPIO_IFEN_IFE3             BIT(3)                          /*!< pin 3 input filter enable */
#define GPIO_IFEN_IFE4             BIT(4)                          /*!< pin 4 input filter enable */
#define GPIO_IFEN_IFE5             BIT(5)                          /*!< pin 5 input filter enable */
#define GPIO_IFEN_IFE6             BIT(6)                          /*!< pin 6 input filter enable */
#define GPIO_IFEN_IFE7             BIT(7)                          /*!< pin 7 input filter enable */
#define GPIO_IFEN_IFE8             BIT(8)                          /*!< pin 8 input filter enable */
#define GPIO_IFEN_IFE9             BIT(9)                          /*!< pin 9 input filter enable */
#define GPIO_IFEN_IFE10            BIT(10)                         /*!< pin 10 input filter enable */
#define GPIO_IFEN_IFE11            BIT(11)                         /*!< pin 11 input filter enable */
#define GPIO_IFEN_IFE12            BIT(12)                         /*!< pin 12 input filter enable */
#define GPIO_IFEN_IFE13            BIT(13)                         /*!< pin 13 input filter enable */
#define GPIO_IFEN_IFE14            BIT(14)                         /*!< pin 14 input filter enable */
#define GPIO_IFEN_IFE15            BIT(15)                         /*!< pin 15 input filter enable */

/* GPIO_PREN */
#define GPIO_PREN_PKE0             BIT(0)                          /*!< pin 0 pad retain enable */
#define GPIO_PREN_PKE1             BIT(1)                          /*!< pin 1 pad retain enable */
#define GPIO_PREN_PKE2             BIT(2)                          /*!< pin 2 pad retain enable */
#define GPIO_PREN_PKE3             BIT(3)                          /*!< pin 3 pad retain enable */
#define GPIO_PREN_PKE4             BIT(4)                          /*!< pin 4 pad retain enable */
#define GPIO_PREN_PKE5             BIT(5)                          /*!< pin 5 pad retain enable */
#define GPIO_PREN_PKE6             BIT(6)                          /*!< pin 6 pad retain enable */
#define GPIO_PREN_PKE7             BIT(7)                          /*!< pin 7 pad retain enable */
#define GPIO_PREN_PKE8             BIT(8)                          /*!< pin 8 pad retain enable */
#define GPIO_PREN_PKE9             BIT(9)                          /*!< pin 9 pad retain enable */
#define GPIO_PREN_PKE10            BIT(10)                         /*!< pin 10 pad retain enable */
#define GPIO_PREN_PKE11            BIT(11)                         /*!< pin 11 pad retain enable */
#define GPIO_PREN_PKE12            BIT(12)                         /*!< pin 12 pad retain enable */
#define GPIO_PREN_PKE13            BIT(13)                         /*!< pin 13 pad retain enable */
#define GPIO_PREN_PKE14            BIT(14)                         /*!< pin 14 pad retain enable */
#define GPIO_PREN_PKE15            BIT(15)                         /*!< pin 15 pad retain enable */

/* GPIO_SREN */
#define GPIO_SREN_SRE0             BIT(0)                          /*!< pin 0 slew rate enable */
#define GPIO_SREN_SRE1             BIT(1)                          /*!< pin 1 slew rate enable */
#define GPIO_SREN_SRE2             BIT(2)                          /*!< pin 2 slew rate enable */
#define GPIO_SREN_SRE3             BIT(3)                          /*!< pin 3 slew rate enable */
#define GPIO_SREN_SRE4             BIT(4)                          /*!< pin 4 slew rate enable */
#define GPIO_SREN_SRE5             BIT(5)                          /*!< pin 5 slew rate enable */
#define GPIO_SREN_SRE6             BIT(6)                          /*!< pin 6 slew rate enable */
#define GPIO_SREN_SRE7             BIT(7)                          /*!< pin 7 slew rate enable */
#define GPIO_SREN_SRE8             BIT(8)                          /*!< pin 8 slew rate enable */
#define GPIO_SREN_SRE9             BIT(9)                          /*!< pin 9 slew rate enable */
#define GPIO_SREN_SRE10            BIT(10)                         /*!< pin 10 slew rate enable */
#define GPIO_SREN_SRE11            BIT(11)                         /*!< pin 11 slew rate enable */
#define GPIO_SREN_SRE12            BIT(12)                         /*!< pin 12 slew rate enable */
#define GPIO_SREN_SRE13            BIT(13)                         /*!< pin 13 slew rate enable */
#define GPIO_SREN_SRE14            BIT(14)                         /*!< pin 14 slew rate enable */
#define GPIO_SREN_SRE15            BIT(15)                         /*!< pin 15 slew rate enable */

/* GPIO_IFCTL */
#define GPIO_IFCTL_IQSP            BITS(28, 31)                    /*!< externale interrupt qualification sampling period for GPIO0 to GPIO15 */
#define GPIO_IFCTL_EIFE0           BIT(0)                          /*!< pin 0 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE1           BIT(1)                          /*!< pin 1 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE2           BIT(2)                          /*!< pin 2 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE3           BIT(3)                          /*!< pin 3 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE4           BIT(4)                          /*!< pin 4 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE5           BIT(5)                          /*!< pin 5 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE6           BIT(6)                          /*!< pin 6 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE7           BIT(7)                          /*!< pin 7 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE8           BIT(8)                          /*!< pin 8 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE9           BIT(9)                          /*!< pin 9 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE10          BIT(10)                         /*!< pin 10 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE11          BIT(11)                         /*!< pin 11 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE12          BIT(12)                         /*!< pin 12 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE13          BIT(13)                         /*!< pin 13 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE14          BIT(14)                         /*!< pin 14 enables digital glitch filter on the interrupt pad input */
#define GPIO_IFCTL_EIFE15          BIT(15)                         /*!< pin 15 enables digital glitch filter on the interrupt pad input */


/* GPIO_IFSCTL0 */
#define GPIO_IFSCTL0_IFSC0         BITS(0, 3)                      /*!< pin 0 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC1         BITS(4, 7)                      /*!< pin 1 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC2         BITS(8, 11)                     /*!< pin 2 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC3         BITS(12, 15)                    /*!< pin 3 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC4         BITS(16, 19)                    /*!< pin 4 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC5         BITS(20, 23)                    /*!< pin 5 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC6         BITS(24, 27)                    /*!< pin 6 maximum interrupt filter counter setting */
#define GPIO_IFSCTL0_IFSC7         BITS(28, 31)                    /*!< pin 7 maximum interrupt filter counter setting */

/* GPIO_IFSCTL1 */
#define GPIO_IFSCTL1_IFSC8         BITS(0, 3)                      /*!< pin 8 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC9         BITS(4, 7)                      /*!< pin 9 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC10        BITS(8, 11)                     /*!< pin 10 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC11        BITS(12, 15)                    /*!< pin 11 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC12        BITS(16, 19)                    /*!< pin 12 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC13        BITS(20, 23)                    /*!< pin 13 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC14        BITS(24, 27)                    /*!< pin 14 maximum interrupt filter counter setting */
#define GPIO_IFSCTL1_IFSC15        BITS(28, 31)                    /*!< pin 15 maximum interrupt filter counter setting */

/* GPIO_TMRALRMSTAT */
#define GPIO_TMRASTAT_PXFFIO0MSK   BIT(0)                          /*!< FFP0 port mode configuration TMR alarm mask */
#define GPIO_TMRASTAT_PXFFIO0      BIT(1)                          /*!< FFIO0 port mode configuration TMR error alarm */
#define GPIO_TMRASTAT_PXFFIO1MSK   BIT(2)                          /*!< FFIO1 port mode configuration TMR alarm error mask */
#define GPIO_TMRASTAT_PXFFIO1      BIT(3)                          /*!< FFIO1 port mode configuration TMR error alarm */
#define GPIO_TMRASTAT_PXGFIOMSK    BIT(4)                          /*!< GFIO port mode configuration TMR alarm error mask */
#define GPIO_TMRASTAT_PXGFIO       BIT(5)                          /*!< GFIO port mode configuration TMR error alarm */
#define GPIO_TMRASTAT_PXRESETMSK   BIT(6)                          /*!< RESET port mode configuration TMR error alarm mask */
#define GPIO_TMRASTAT_PXRESET      BIT(7)                          /*!< RESET port mode configuration TMR error alarm */

/* constants definitions */
typedef FlagStatus bit_status;

/* output mode definitions */
#define CTL_CLTR(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_MODE_INPUT            CTL_CLTR(0)                     /*!< input mode */
#define GPIO_MODE_OUTPUT           CTL_CLTR(1)                     /*!< output mode */
#define GPIO_MODE_AF               CTL_CLTR(2)                     /*!< alternate function mode */
#define GPIO_MODE_ANALOG           CTL_CLTR(3)                     /*!< analog mode */

