sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.h
/* pull-up/pull-down value definitions */
#define PUD_PUPD(regval)           (BITS(0, 1) & ((uint32_t)(regval) << 0))
#define GPIO_PUPD_NONE             PUD_PUPD(0)                     /*!< floating mode, no pull-up and pull-down resistors */
#define GPIO_PUPD_PULLUP           PUD_PUPD(1)                     /*!< with pull-up resistor */
#define GPIO_PUPD_PULLDOWN         PUD_PUPD(2)                     /*!< with pull-down resistor */

/* GPIO pin definitions */
#define GPIO_PIN_0                 BIT(0)                          /*!< GPIO pin 0 */
#define GPIO_PIN_1                 BIT(1)                          /*!< GPIO pin 1 */
#define GPIO_PIN_2                 BIT(2)                          /*!< GPIO pin 2 */
#define GPIO_PIN_3                 BIT(3)                          /*!< GPIO pin 3 */
#define GPIO_PIN_4                 BIT(4)                          /*!< GPIO pin 4 */
#define GPIO_PIN_5                 BIT(5)                          /*!< GPIO pin 5 */
#define GPIO_PIN_6                 BIT(6)                          /*!< GPIO pin 6 */
#define GPIO_PIN_7                 BIT(7)                          /*!< GPIO pin 7 */
#define GPIO_PIN_8                 BIT(8)                          /*!< GPIO pin 8 */
#define GPIO_PIN_9                 BIT(9)                          /*!< GPIO pin 9 */
#define GPIO_PIN_10                BIT(10)                         /*!< GPIO pin 10 */
#define GPIO_PIN_11                BIT(11)                         /*!< GPIO pin 11 */
#define GPIO_PIN_12                BIT(12)                         /*!< GPIO pin 12 */
#define GPIO_PIN_13                BIT(13)                         /*!< GPIO pin 13 */
#define GPIO_PIN_14                BIT(14)                         /*!< GPIO pin 14 */
#define GPIO_PIN_15                BIT(15)                         /*!< GPIO pin 15 */
#define GPIO_PIN_ALL               BITS(0, 15)                     /*!< GPIO pin all */

/* GPIO mode configuration values */
#define GPIO_MODE_SET(n, mode)     ((uint32_t)((uint32_t)(mode) << (2U * (n))))
#define GPIO_MODE_MASK(n)          ((uint32_t)((uint32_t)0x3U << (2U * (n))))

/* GPIO pull-up/pull-down values */
#define GPIO_PUPD_SET(n, pupd)     ((uint32_t)((uint32_t)(pupd) << (2U * (n))))
#define GPIO_PUPD_MASK(n)          ((uint32_t)((uint32_t)(0x3U) << (2U * (n))))

/* GPIO output speed values */
#define GPIO_OSPEED_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED_MASK(n)        ((uint32_t)((uint32_t)(0x3U) << (2U * (n))))

/* GPIO output type definitions*/
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))              /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))              /*!< open drain mode */

/* GPIO output max speed value definitions*/
#define OSPD_OSPD0(regval)         (BITS(0, 1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_LEVEL_0        OSPD_OSPD0(0)                   /*!< output speed level 0 */
#define GPIO_OSPEED_LEVEL_1        OSPD_OSPD0(1)                   /*!< output speed level 1 */
#define GPIO_OSPEED_LEVEL_2        OSPD_OSPD0(2)                   /*!< output speed level 2 */

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           ((uint32_t)((uint32_t)(0xFU) << (4U * (n))))

/* GPIO alternate function value difinitions*/
#define AF(regval)                 (BITS(0, 3) & ((uint32_t)(regval) << 0)) 
#define GPIO_AF_0                  AF(0)                           /*!< alternate function 0 selected */
#define GPIO_AF_1                  AF(1)                           /*!< alternate function 1 selected */
#define GPIO_AF_2                  AF(2)                           /*!< alternate function 2 selected */
#define GPIO_AF_3                  AF(3)                           /*!< alternate function 3 selected */
#define GPIO_AF_4                  AF(4)                           /*!< alternate function 4 selected */
#define GPIO_AF_5                  AF(5)                           /*!< alternate function 5 selected */
#define GPIO_AF_6                  AF(6)                           /*!< alternate function 6 selected */
#define GPIO_AF_7                  AF(7)                           /*!< alternate function 7 selected */
#define GPIO_AF_8                  AF(8)                           /*!< alternate function 8 selected */
#define GPIO_AF_9                  AF(9)                           /*!< alternate function 9 selected */
#define GPIO_AF_10                 AF(10)                           /*!< alternate function 10 selected */
#define GPIO_AF_11                 AF(11)                           /*!< alternate function 11 selected */
#define GPIO_AF_12                 AF(12)                           /*!< alternate function 12 selected */
#define GPIO_AF_13                 AF(13)                           /*!< alternate function 13 selected */
#define GPIO_AF_14                 AF(14)                           /*!< alternate function 14 selected */
#define GPIO_AF_15                 AF(15)                           /*!< alternate function 15 selected */

/* GPIO external interrupt sample counter value */
#define GPIO_IFSCTL_SPLCNT_SET(n, splcnt)  ((uint32_t)((uint32_t)(splcnt) << (4U * (n))))
#define GPIO_IFSCTL_SPLCNT_MASK(n)         ((uint32_t)((uint32_t)(0xFU) << (4U * (n))))

/* GPIO TMR alarm value definitions*/
#define GPIO_TMRASTAT_ERROR_ALL      (GPIO_TMRASTAT_PXFFIO0 | GPIO_TMRASTAT_PXFFIO1 | GPIO_TMRASTAT_PXGFIO | GPIO_TMRASTAT_PXRESET)
#define GPIO_TMRASTAT_MASK_ALL       (GPIO_TMRASTAT_PXFFIO0MSK | GPIO_TMRASTAT_PXFFIO1MSK | GPIO_TMRASTAT_PXGFIOMSK | GPIO_TMRASTAT_PXRESETMSK)

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_GPIO_PERIPH(periph)                 (((periph) != GPIOA) && \
                                                 ((periph) != GPIOB) && \
                                                 ((periph) != GPIOC) && \
                                                 ((periph) != GPIOD) && \
                                                 ((periph) != GPIOE) && \
                                                 ((periph) != GPIOF) && \
                                                 ((periph) != GPIOG) && \
                                                 ((periph) != GPIOH) && \
                                                 ((periph) != GPIOI) && \
                                                 ((periph) != GPIOJ) && \
                                                 ((periph) != GPIOK) && \
                                                 ((periph) != GPIOL) && \
                                                 ((periph) != GPIOM) && \
                                                 ((periph) != GPION))

/* check GPIO pin modes */
#define NOT_GPIO_MODE(mode)                     (((mode) != GPIO_MODE_INPUT)  && \
                                                 ((mode) != GPIO_MODE_OUTPUT) && \
                                                 ((mode) != GPIO_MODE_AF) && \
                                                 ((mode) != GPIO_MODE_ANALOG))

/* check GPIO pin pull modes */
#define NOT_GPIO_PULL_MODE(pull_up_down)        (((pull_up_down) != GPIO_PUPD_NONE)   && \
                                                 ((pull_up_down) != GPIO_PUPD_PULLUP) && \
                                                 ((pull_up_down) != GPIO_PUPD_PULLDOWN))

/* check GPIO pin */
#define NOT_GPIO_PIN(pin)                       (((pin) == 0x00000000U) || ((pin) > 0x0000FFFFU))

