sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.h
/* check GPIO pin output mode */
#define NOT_GPIO_OTYPE(otype)                   (((otype) != GPIO_OTYPE_PP) && \
                                                 ((otype) != GPIO_OTYPE_OD))

/* check GPIO pin speed */
#define NOT_GPIO_SPEED(speed)                   (((speed) != GPIO_OSPEED_LEVEL_0) && \
                                                 ((speed) != GPIO_OSPEED_LEVEL_1) && \
                                                 ((speed) != GPIO_OSPEED_LEVEL_2))

/* check reset and set value */
#define NOT_RESET_SET(value)                    (((value) != RESET)  && \
                                                 ((value) != SET))

/* check GPIO pin AF */
#define NOT_GPIO_AF(alt_func_num)               (((alt_func_num) != GPIO_AF_0) && \
                                                 ((alt_func_num) != GPIO_AF_1) && \
                                                 ((alt_func_num) != GPIO_AF_2) && \
                                                 ((alt_func_num) != GPIO_AF_3) && \
                                                 ((alt_func_num) != GPIO_AF_4) && \
                                                 ((alt_func_num) != GPIO_AF_5) && \
                                                 ((alt_func_num) != GPIO_AF_6) && \
                                                 ((alt_func_num) != GPIO_AF_7) && \
                                                 ((alt_func_num) != GPIO_AF_8) && \
                                                 ((alt_func_num) != GPIO_AF_9) && \
                                                 ((alt_func_num) != GPIO_AF_10) && \
                                                 ((alt_func_num) != GPIO_AF_11) && \
                                                 ((alt_func_num) != GPIO_AF_12) && \
                                                 ((alt_func_num) != GPIO_AF_13) && \
                                                 ((alt_func_num) != GPIO_AF_14) && \
                                                 ((alt_func_num) != GPIO_AF_15))

/* check external interrupt sampling period */
#define NOT_SAMPLING_PERIOD(iqsp)                (0x0FU < (iqsp))

/* check maximum interrupt filter counter */
#define NOT_FLITER_COUNTER(counter)              (0x0FU < (counter))

/* check TMR alarm status */
#define NOT_TMRALARM_STATUS(alarm)               (((alarm) != GPIO_TMRASTAT_PXFFIO0) && \
                                                  ((alarm) != GPIO_TMRASTAT_PXFFIO1) && \
                                                  ((alarm) != GPIO_TMRASTAT_PXGFIO) && \
                                                  ((alarm) != GPIO_TMRASTAT_PXRESET))

/* check TMR alarm mask status */
#define NOT_TMRALARM_MASK(alarm_msk)             (((alarm_msk) != GPIO_TMRASTAT_PXFFIO0MSK) && \
                                                  ((alarm_msk) != GPIO_TMRASTAT_PXFFIO1MSK) && \
                                                  ((alarm_msk) != GPIO_TMRASTAT_PXGFIOMSK) && \
                                                  ((alarm_msk) != GPIO_TMRASTAT_PXRESETMSK))

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */

/* reset GPIO port */
void gpio_deinit(uint32_t gpio_periph);
/* set GPIO mode */
void gpio_mode_set(uint32_t gpio_periph, uint32_t mode, uint32_t pull_up_down, uint32_t pin);
/* set GPIO output type and speed */
void gpio_output_options_set(uint32_t gpio_periph, uint8_t otype, uint32_t speed, uint32_t pin);

/* set GPIO pin bit */
void gpio_bit_set(uint32_t gpio_periph, uint32_t pin);
/* reset GPIO pin bit */
void gpio_bit_reset(uint32_t gpio_periph, uint32_t pin);
/* write data to the specified GPIO pin */
void gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value);
/* write data to the specified GPIO port */
void gpio_port_write(uint32_t gpio_periph, uint16_t data);
/* get GPIO pin input status */
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port input status */
uint16_t gpio_input_port_get(uint32_t gpio_periph);
/* get GPIO pin output status */
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port output status */
uint16_t gpio_output_port_get(uint32_t gpio_periph);
/* set GPIO alternate function */
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin);
/* lock GPIO pin bit */
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO pin status */
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO port status */
void gpio_port_toggle(uint32_t gpio_periph);

/* enable GPIO port safe mode */
void gpio_safe_mode_enable(uint32_t gpio_periph, uint32_t pin);
/* disable GPIO port safe mode */
void gpio_safe_mode_disable(uint32_t gpio_periph, uint32_t pin);
/* enable GPIO port filtering */
void gpio_port_filter_enable(uint32_t gpio_periph, uint32_t pin);
/* disable GPIO port filtering */
void gpio_port_filter_disable(uint32_t gpio_periph, uint32_t pin);
/* enable GPIO port retain */
void gpio_port_retain_enable(uint32_t gpio_periph, uint32_t pin);
/* disable GPIO port retain */
void gpio_port_retain_disable(uint32_t gpio_periph, uint32_t pin);
/* enable GPIO slew rate */
void gpio_slew_enable(uint32_t gpio_periph, uint32_t pin);
/* disable GPIO slew rate */
void gpio_slew_disable(uint32_t gpio_periph, uint32_t pin);
/* enable GPIO interrupt filtering control */
void gpio_int_filt_enable(uint32_t gpio_periph, uint32_t pin);
/* disable GPIO interrupt filtering control */
void gpio_int_filt_disable(uint32_t gpio_periph, uint32_t pin);
/* set GPIO interrupt filtering sampling period*/
void gpio_int_filt_sampling_period_set(uint32_t gpio_periph, uint8_t sampling_period);
/* set GPIO interrupt filtering sampling counter*/
void gpio_int_filt_sample_counter_set(uint32_t gpio_periph, uint32_t pin, uint8_t counter);

/* get GPIO port TMR alarm status*/
FlagStatus gpio_tmr_alarm_status_get(uint32_t gpio_periph, uint32_t tmr_alarm);
/* clear GPIO port TMR alarm status */
void gpio_tmr_alarm_status_clear(uint32_t gpio_periph, uint32_t tmr_alarm);
/* get GPIO port TMR alarm mask status */
FlagStatus gpio_tmr_alarm_mask_status_get(uint32_t gpio_periph, uint32_t tmr_alarm);
/* enable mask GPIO port TMR alarm */
void gpio_tmr_alarm_mask_enable(uint32_t gpio_periph, uint32_t tmr_alarm);
/* clear mask GPIO port TMR alarm status */
void gpio_tmr_alarm_mask_disable(uint32_t gpio_periph, uint32_t tmr_alarm);

#endif /* GD32A7XX_GPIO_H */
